Revit 2027 API
IExternalDataManagerServer.IsEnabledInFamilyDocuments Method
 Checks if the data type enabled in family documents.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
bool IsEnabledInFamilyDocuments()
Function IsEnabledInFamilyDocuments As Boolean
bool IsEnabledInFamilyDocuments()
abstract IsEnabledInFamilyDocuments : unit -> bool
Return Value
Boolean
Remarks
 Revit calls this once when registering the server with a document to determine whether the server should be exposed inside the Family Editor. Return false if the data type relies on project-only documents.
See Also
Reference
IExternalDataManagerServer Interface
Autodesk.Revit.UI Namespace